In [1]:
from bs4 import BeautifulSoup as bs
import pandas as pd
from splinter import Browser
import time
import os

In [2]:
# executable_path = {'executable_path': 'C:\\Users\\Gogster\\Desktop\\Drivers\\chromedriver.exe'}
executable_path = {'executable_path': 'chromedriver.exe'}
# I changed the CHROMEDRIVER!!! as per Ernest
browser = Browser('chrome', **executable_path, headless=False)

# ZIKA Information

In [ ]:
urlzika = 'https://www.cdc.gov/zika/reporting/2017-case-counts.html'
browser.visit(urlzika)
htmlzika=browser.html

In [ ]:
# browser.visit(url)
zika_soup = bs(browser.html, 'lxml')
# print(zika_soup.prettify())
time.sleep(2)

In [ ]:
#scrape table
tables = pd.read_html(urlzika)
   #format
df = tables[0]
df.columns = ['State', 'Count(w/symptoms)', "%", 'Count(w/o symptoms)','%']

In [ ]:
df

# Weather for 2015

In [ ]:
# url = 'https://www.usclimatedata.com/climate/los-angeles/california/united-states/usca1339'
# df = pd.read_html(url)

In [ ]:
# url2015='https://www.usclimatedata.com/climate/los-angeles/california/united-states/usca1339/2015/1'

In [3]:
url2015='https://www.usclimatedata.com/climate/los-angeles/california/united-states/usca1339/2015/1'
url2016='https://www.usclimatedata.com/climate/los-angeles/california/united-states/usca1339/2016/1'
url2017='https://www.usclimatedata.com/climate/los-angeles/california/united-states/usca1339/2017/1'
browser.visit(url2015)
html=browser.html

In [ ]:
# # browser.visit(url)
# soup2015 = bs(browser.html, 'lxml')
# print(soup2015.prettify())
# time.sleep(2)

In [ ]:
# news_title = news_soup.find(class_='content_title', string=True)
# print(news_title)
# time.sleep(2)

In [ ]:
# # news_p = news_soup.find(class_='article_teaser_body', string=True)
# news_p = soup2015.find('td', class_ ='align_right temperature_red')
# # news_p= news_p.get_text
# print(news_p)

In [4]:
#read first table
df2015 = pd.read_html(url2015)[0]
#read second table
df20151 = pd.read_html(url2015)[1]
#convert tables to pandas dataframes
table_df2015=pd.DataFrame(df2015)
table_df20151=pd.DataFrame(df20151)

In [ ]:
# df

In [ ]:
# df1

In [ ]:
#show first table
# table_df

In [5]:
#show second table, remove index
table_df20151=table_df20151.drop(table_df20151.index[[0]],axis=1)
# table_df1

In [6]:
#concatenate both tables horizontally and remove row 4 and 5
result2015 = pd.concat([table_df2015, table_df20151], axis=1, sort=False)
result2015 = result2015.drop(result2015.index[[0,4,5]])
result2015.columns = ['Parameter', 'Jan', "Feb", 'Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']
result2015

,Parameter,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
1,Average high in :,67,67,67,69,70,73,77,79,78,75,71,67
2,Average low in :,51,51,51,53,56,58,62,62,62,59,55,51
3,Av. precipitation in :,3.98,5.08,2.83,0.98,0.31,0.12,0.04,0.04,0.24,0.91,1.38,2.76

In [7]:
result2015 = result2015.rename_axis(None)

In [8]:
# result2015

,Parameter,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
1,Average high in :,67,67,67,69,70,73,77,79,78,75,71,67
2,Average low in :,51,51,51,53,56,58,62,62,62,59,55,51
3,Av. precipitation in :,3.98,5.08,2.83,0.98,0.31,0.12,0.04,0.04,0.24,0.91,1.38,2.76

In [9]:
result2015['average'] = result2015.mean(numeric_only=True, axis=1)
# result2015['state']=result2015.
result2015

,Parameter,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,average
1,Average high in :,67,67,67,69,70,73,77,79,78,75,71,67,NaN
2,Average low in :,51,51,51,53,56,58,62,62,62,59,55,51,NaN
3,Av. precipitation in :,3.98,5.08,2.83,0.98,0.31,0.12,0.04,0.04,0.24,0.91,1.38,2.76,NaN

# Weather 2016

In [10]:
browser.visit(url2016)
html=browser.html

In [11]:
#read first table
df2016 = pd.read_html(url2016)[0]
#read second table
df20161 = pd.read_html(url2016)[1]
#convert tables to pandas dataframes
table_df2016=pd.DataFrame(df2016)
table_df20161=pd.DataFrame(df20161)

In [12]:
table_df20161=table_df20161.drop(table_df20161.index[[0]],axis=1)

In [13]:
result2016 = pd.concat([table_df2016, table_df20161], axis=1, sort=False)
result2016 = result2016.drop(result2016.index[[4,5]])

In [14]:
result2016 = result2016.rename_axis(None)

In [15]:
result2016['average'] = result2016.mean(numeric_only=True, axis=1)

In [26]:
# table_df20161=table_df20161.insert(table_df20161.index[[0]],axis=0)
# table_df20161=table_df20161.insert(loc=1, column='state', value=new_col)
#MONICA----add a column for state?
result2016['state'] = result2016.str(numeric_only=False, axis=1)

AttributeError: 'DataFrame' object has no attribute 'str'

In [16]:
result2016

,0,1,2,3,4,5,6,1,2,3,4,5,6,average
0,NaN,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,NaN
1,Average high in :,67,67,67,69,70,73,77,79,78,75,71,67,NaN
2,Average low in :,51,51,51,53,56,58,62,62,62,59,55,51,NaN
3,Av. precipitation in :,3.98,5.08,2.83,0.98,0.31,0.12,0.04,0.04,0.24,0.91,1.38,2.76,NaN

# Weather 2017

In [ ]:
browser.visit(url2017)
html=browser.html

In [ ]:
#read first table
df2017 = pd.read_html(url2017)[0]
#read second table
df20171 = pd.read_html(url2017)[1]
#convert tables to pandas dataframes
table_df2017=pd.DataFrame(df2017)
table_df20171=pd.DataFrame(df20171)

In [ ]:
table_df20161=table_df20161.drop(table_df20161.index[[0]],axis=1)

In [ ]:
result2016['state'] = result2016.str(numeric_only=False, axis=1)

In [ ]:
# df.columns = ['Component', 'Measurement']
html_table = df.to_html(index=False)
html_table= html_table.replace('\n', '')

In [ ]:
html_table